<html>

<head>
<link href="style.css" rel="stylesheet" type="text/css">
<meta charset="utf-8">
</head>

<h3>Mise en &oelig;uvre AES de Brian Gladman</h3>

<P>Les routines de chiffrement et de d&eacute;chiffrement de WinRAR utilisent quelques &eacute;l&eacute;ments de code de la mise en &oelig;uvre AES de Brian Gladman. Une licence est accord&eacute;e sous r&eacute;serve des conditions suivantes :</P>

<hr>
<p>Copyright (c) 2002, Dr Brian Gladman &lt; &gt;, Worcester, Royaume Uni.</p>
<p>Tous droits r&eacute;serv&eacute;s.</p>

<p>CONDITIONS G&Eacute;N&Eacute;RALES</p>

<p>La distribution et l&apos;utilisation gratuites de ce logiciel, tant sous forme de source que sous forme de fichiers binaires, sont autoris&eacute;es (avec ou sans modification) &agrave; condition que :</p>

<ol>
   <li>Les distributions du code source doivent inclure la mention de copyright ci-dessus, cette liste de conditions et la clause d&apos;exclusion de responsabilit&eacute; suivante.<li>Les distributions sous forme binaire doivent inclure la mention de copyright ci-dessus, cette liste de conditions et la clause d&apos;exclusion de responsabilit&eacute; suivante dans la documentation et/ou les autres documents li&eacute;s.<li>Le nom du titulaire du copyright ne doit pas &ecirc;tre utilis&eacute; pour promouvoir des produits utilisant ce logiciel sans accord pr&eacute;alable.</ol>

<p>EN OUTRE, &agrave; condition que cet avis soit conserv&eacute; dans son int&eacute;gralit&eacute;, ce produit peut &ecirc;tre distribu&eacute; sous les conditions de la licence GNU GPL (General Public License), auquel cas les dispositions de la licence GPL s&apos;appliquent AU LIEU de celles mentionn&eacute;es ci-dessus.</p>

<p>CLAUSE DE NON-RESPONSABILIT&Eacute;</p>

<p>Ce logiciel est fourni « en l&apos;&eacute;tat », sans aucune garanti explicite ou implicite quant &agrave; ses propri&eacute;t&eacute;s, y compris mais sans s&apos;y limiter, sa conformit&eacute;.</p>
<hr>

<p>Vous trouverez le code source de ce package ainsi que des liens vers d&apos;autres technologies de chiffrement et d&apos;autres projets informatiques &agrave; l&apos;adresse suivante : <a href="http://www.gladman.me.uk" target="_blank">Site Web de Brian Gladman.</a>.</p>

</html>
